Autodesk.Revit.DB.PointClouds.PointCollection.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.PointClouds.PointCollection.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.PointClouds.PointCollection.GetPointCollectionIterator
Creates and returns an iterator for the points contained in this collection.
Returns:
New iterator created, make sure to call 'free' on it when finished using it.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCollection.GetPointBufferPointer
Returns an unsafe pointer to the buffer in which this collection stores the points.
Returns:
The pointer to the collection's storage.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCollection.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCollection.Count
The number of points in this collection.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCollection.GetPointIterator
Creates and returns an iterator for the points contained in this collection.
Returns:
New iterator created, make sure to call 'free' on it when finished using it.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCollection
A class that represents a set of points created and returned by Revit in response to a query.
Since:
2012